In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'City': ['Chicago', 'Chicago', 'Boston', 'Portland', 'Portland', 'Portland'],
                   'State': ['IL', 'IL', 'MA', 'ME', 'OR', 'ME'],
                   'Data1': np.random.randn(6),
                   'Data2': np.random.randn(6)})
df

       City State     Data1     Data2
0   Chicago    IL  0.764614 -0.449181
1   Chicago    IL -1.708394 -0.593543
2    Boston    MA  0.247451 -0.373240
3  Portland    ME -0.149316  0.339205
4  Portland    OR -0.555327 -1.100220
5  Portland    ME  1.622931 -0.492489

In [5]:
data1agg = df['Data1'].groupby(df['City'])
max_data1agg = data1agg.max()
mean_data1agg = data1agg.mean()

print(max_data1agg)
print()
print(mean_data1agg)

City
Boston      0.247451
Chicago     0.764614
Portland    1.622931
Name: Data1, dtype: float64

City
Boston      0.247451
Chicago    -0.471890
Portland    0.306096
Name: Data1, dtype: float64

In [7]:
for gname, gvalue in data1agg:
    print('Group Name:', gname)
    print('Group Value:', gvalue)
    print('-' * 30)

Group Name: Boston
Group Value: 2    0.247451
Name: Data1, dtype: float64
------------------------------
Group Name: Chicago
Group Value: 0    0.764614
1   -1.708394
Name: Data1, dtype: float64
------------------------------
Group Name: Portland
Group Value: 3   -0.149316
4   -0.555327
5    1.622931
Name: Data1, dtype: float64
------------------------------

In [12]:
gby1 = df.groupby(['State', 'City']).min()
print(gby1)

                   Data1     Data2
State City
IL    Chicago  -1.708394 -0.593543
MA    Boston    0.247451 -0.373240
ME    Portland -0.149316 -0.492489
OR    Portland -0.555327 -1.100220

In [13]:
for gname, gvalue in df['Data2'].groupby([df['State'], df['City']]):
    print('Group Name:', gname)
    print('Group Value:', gvalue)
    print('-' * 30)

Group Name: ('IL', 'Chicago')
Group Value: 0   -0.449181
1   -0.593543
Name: Data2, dtype: float64
------------------------------
Group Name: ('MA', 'Boston')
Group Value: 2   -0.37324
Name: Data2, dtype: float64
------------------------------
Group Name: ('ME', 'Portland')
Group Value: 3    0.339205
5   -0.492489
Name: Data2, dtype: float64
------------------------------
Group Name: ('OR', 'Portland')
Group Value: 4   -1.10022
Name: Data2, dtype: float64
------------------------------

In [14]:
df['Data2'].groupby([df['State'], df['City']]).count()

State  City
IL     Chicago     2
MA     Boston      1
ME     Portland    2
OR     Portland    1
Name: Data2, dtype: int64

In [15]:
spellout = {'IL': 'Illinois',
            'MA': 'Massachussetts',
            'OR': 'Oregon',
            'ME': 'Maine'}

In [16]:
df['State'].map(lambda x: '-'+ x +'-')

0    -IL-
1    -IL-
2    -MA-
3    -ME-
4    -OR-
5    -ME-
Name: State, dtype: object

In [17]:
df['State'].map(lambda x: spellout[x])

0          Illinois
1          Illinois
2    Massachussetts
3             Maine
4            Oregon
5             Maine
Name: State, dtype: object

In [18]:
df['State'] = df['State'].map(lambda x: spellout[x])
df

       City           State     Data1     Data2
0   Chicago        Illinois  0.764614 -0.449181
1   Chicago        Illinois -1.708394 -0.593543
2    Boston  Massachussetts  0.247451 -0.373240
3  Portland           Maine -0.149316  0.339205
4  Portland          Oregon -0.555327 -1.100220
5  Portland           Maine  1.622931 -0.492489